#coding=utf-8
#!/usr/bin/python
import sys
sys.path.append('..') 
from base.spider import Spider
import json

class Spider(Spider):
	def getName(self):
		return "虎牙"
	def init(self,extend=""):
		pass
	def isVideoFormat(self,url):
		pass
	def manualVideoCheck(self):
		pass
	def homeContent(self,filter):
		result = {}
		cateManual = {
			"一起看": "一起看",
			"三国杀": "三国杀",
			"网游竞技": "网游竞技",
"英雄联盟": "英雄联盟",
"王者荣耀": "王者荣耀",
"英雄联盟电竞经理": "英雄联盟电竞经理",
"一起看": "一起看",
"星秀": "星秀",
"暗黑破坏神：不朽": "暗黑破坏神：不朽",
"暗区突围": "暗区突围",
"生死狙击2": "生死狙击2",
"户外": "户外",
"金铲铲之战": "金铲铲之战",
"和平精英": "和平精英",
"英雄联盟手游": "英雄联盟手游",
"天天吃鸡": "天天吃鸡",
"lol云顶之弈": "lol云顶之弈",
"剑侠世界3": "剑侠世界3",
"不良人3": "不良人3",
"二次元": "二次元",
"穿越火线": "穿越火线",
"主机游戏": "主机游戏",
"美食": "美食",
"综合手游": "综合手游",
"暴雪专区": "暴雪专区",
"颜值": "颜值",
"CF手游": "CF手游",
"交友": "交友",
"地下城与勇士": "地下城与勇士",
"新游广场": "新游广场",
"体育": "体育",
"棋牌桌游": "棋牌桌游",
"我的世界": "我的世界",
"炉石传说": "炉石传说",
"魔兽世界": "魔兽世界",
"QQ飞车手游": "QQ飞车手游",
"DOTA2": "DOTA2",
"方舟": "方舟",
"跑跑卡丁车手游": "跑跑卡丁车手游",
"火影忍者手游": "火影忍者手游",
"球球大作战": "球球大作战",
"CS:GO": "CS:GO",
"DOTA1": "DOTA1",
"QQ飞车": "QQ飞车",
"问道": "问道",
"魔兽争霸3": "魔兽争霸3",
"逆战": "逆战",
"梦三国": "梦三国",
"三国杀": "三国杀",
"网游竞技": "网游竞技",
"手游休闲": "手游休闲",
"娱乐天地": "娱乐天地",
"放映厅": "放映厅",
"单机热游": "单机热游",
"组队": "组队",
"二次元手游": "二次元手游",
"吃喝玩乐": "吃喝玩乐",
"原神": "原神",
"MMORPG": "MMORPG",
"互动点播": "互动点播",
"动作游戏": "动作游戏",
"永劫无间": "永劫无间",
"原创": "原创",
"虎牙地方": "虎牙地方",
"传奇": "传奇",
"御龙在天": "御龙在天",
"军事游戏": "军事游戏",
"传奇类游戏": "传奇类游戏",
"射击综合游戏": "射击综合游戏",
"幻塔": "幻塔",
"战争冲突": "战争冲突",
"虎牙领主争霸": "虎牙领主争霸",
"王者模拟战": "王者模拟战",
"坦克世界": "坦克世界",
"一起玩": "一起玩",
"传奇手游": "传奇手游",
"天龙八部手游": "天龙八部手游",
"虎牙文化": "虎牙文化",
"明日之后": "明日之后",
"Dread Hunger": "Dread Hunger",
"艾尔登法环": "艾尔登法环",
"永恒之塔": "永恒之塔",
"英魂之刃": "英魂之刃",
"第五人格": "第五人格",
"COD手游": "COD手游",
"虚拟偶像": "虚拟偶像",
"音乐": "音乐",
"彩虹岛Online": "彩虹岛Online",
"趣分享": "趣分享",
"逃离塔科夫": "逃离塔科夫",
"狼人杀手游": "狼人杀手游",
"探索": "探索",
"剑灵": "剑灵",
"Apex英雄": "Apex英雄",
"炉石战棋": "炉石战棋",
"DNF手游": "DNF手游",
"欢乐麻将": "欢乐麻将",
"天涯明月刀手游": "天涯明月刀手游",
"怀旧游戏": "怀旧游戏",
"冒险岛": "冒险岛",
"俄罗斯钓鱼4": "俄罗斯钓鱼4",
"欢乐斗地主": "欢乐斗地主",
"神武4手游": "神武4手游",
"起凡：群雄逐鹿": "起凡：群雄逐鹿",
"部落：上升": "部落：上升",
"御龙在天手游": "御龙在天手游",
"体育游戏": "体育游戏",
"神武4电脑版": "神武4电脑版",
"诛仙3": "诛仙3",
"CFHD": "CFHD",
"热血江湖": "热血江湖",
"枪神纪": "枪神纪",
"QQ三国": "QQ三国",
"英雄杀": "英雄杀",
"九阴真经": "九阴真经",
"三国志战略版": "三国志战略版",
"天天狼人": "天天狼人",
"NBA2KOL系列": "NBA2KOL系列",
"征途": "征途",
"多乐棋牌": "多乐棋牌",
"问道手游": "问道手游",
"寻仙": "寻仙",
"龙之谷": "龙之谷",
"草根传奇": "草根传奇",
"阴阳师": "阴阳师",
"暗黑破坏神": "暗黑破坏神",
"直播购": "直播购",
"忍者必须死3": "忍者必须死3",
"DayZ独立版": "DayZ独立版",
"荒野行动PC版": "荒野行动PC版",
"斗战神": "斗战神",
"迷你世界": "迷你世界",
"逆水寒": "逆水寒",
"恐惧之间": "恐惧之间",
"斗罗大陆：魂师对决": "斗罗大陆：魂师对决",
"战舰世界": "战舰世界",
"反恐精英Online": "反恐精英Online",
"狼人杀": "狼人杀",
"妄想山海": "妄想山海",
"旅游": "旅游",
"刀剑英雄": "刀剑英雄",
"流放之路": "流放之路",
"摔跤城大乱斗": "摔跤城大乱斗",
"诛仙世界": "诛仙世界",
"QQ华夏": "QQ华夏",
"奶块": "奶块",
"生死狙击": "生死狙击",
"部落冲突": "部落冲突",
"魔兽世界怀旧服": "魔兽世界怀旧服",
"香肠派对": "香肠派对",
"恐鬼症": "恐鬼症",
"创造与魔法": "创造与魔法",
"完美世界手游": "完美世界手游",
"率土之滨": "率土之滨",
"星球大战系列": "星球大战系列",
"SKY光遇": "SKY光遇",
"铁甲雄兵": "铁甲雄兵",
"JJ棋牌": "JJ棋牌",
"派对": "派对",
"大唐无双零": "大唐无双零",
"梦幻新诛仙": "梦幻新诛仙",
"巅峰战舰": "巅峰战舰",
"星际战甲": "星际战甲",
"崩坏3": "崩坏3",
"欧洲卡车模拟": "欧洲卡车模拟",
"绿茵信仰": "绿茵信仰",
"狼人杀官方": "狼人杀官方",
"逃跑吧！少年": "逃跑吧！少年",
"征途2": "征途2",
"新倩女幽魂": "新倩女幽魂",
"天涯明月刀": "天涯明月刀",
"天天象棋": "天天象棋",
"倩女幽魂手游": "倩女幽魂手游",
"武侠乂手游": "武侠乂手游",
"怪物猎人：崛起": "怪物猎人：崛起",
"中国象棋": "中国象棋",
"怪物猎人物语": "怪物猎人物语",
"饥荒": "饥荒",
"失落的方舟": "失落的方舟",
"天谕手游": "天谕手游",
"重返帝国": "重返帝国",
"梦想世界3": "梦想世界3",
"大话西游2": "大话西游2",
"互动剧游": "互动剧游",
"万国觉醒": "万国觉醒",
"完美端游系列": "完美端游系列",
"斗破苍穹手游": "斗破苍穹手游",
"新笑傲江湖": "新笑傲江湖",
"多多自走棋": "多多自走棋",
"天天酷跑": "天天酷跑",
"天翼决": "天翼决",
"甜蜜之家": "甜蜜之家",
"守望先锋": "守望先锋",
"弹弹堂手游": "弹弹堂手游",
"反恐行动online": "反恐行动online",
"新剑侠情缘手游": "新剑侠情缘手游",
"英魂之刃口袋版": "英魂之刃口袋版",
"云上城之歌": "云上城之歌",
"FIFA Online系列": "FIFA Online系列",
"奇迹MU：觉醒": "奇迹MU：觉醒",
"千年3": "千年3",
"无期迷途": "无期迷途",
"造梦西游OL": "造梦西游OL",
"SCUM": "SCUM",
"超击突破": "超击突破",
"港诡实录": "港诡实录",
"丝路传说2": "丝路传说2",
"纸人": "纸人",
"无神之界": "无神之界",
"战争雷霆": "战争雷霆",
"剑网3": "剑网3",
"武林外传一世琴缘": "武林外传一世琴缘",
"命运2": "命运2",
"最强NBA": "最强NBA",
"QQ自由幻想": "QQ自由幻想",
"时空猎人3": "时空猎人3",
"逆水寒手游": "逆水寒手游",
"星际争霸": "星际争霸",
"航海王热血航线": "航海王热血航线",
"王牌竞速": "王牌竞速",
"战地5": "战地5",
"精灵盛典：黎明": "精灵盛典：黎明",
"永恒纪元：戒": "永恒纪元：戒",
"神泣": "神泣",
"骑马与砍杀系列": "骑马与砍杀系列",
"只狼：影逝二度": "只狼：影逝二度",
"北凉悍刀行": "北凉悍刀行",
"洛克王国": "洛克王国",
"植物大战僵尸": "植物大战僵尸",
"三国战纪2": "三国战纪2",
"跑跑卡丁车": "跑跑卡丁车",
"全民枪战2": "全民枪战2",
"远征Online梦想版": "远征Online梦想版",
"诛仙手游": "诛仙手游",
"方舟手游": "方舟手游",
"混沌起源": "混沌起源",
"雷曼：传奇": "雷曼：传奇",
"怪物猎人世界": "怪物猎人世界",
"育碧游戏": "育碧游戏",
"FIFA足球世界": "FIFA足球世界",
"黎明觉醒": "黎明觉醒",
"荒野乱斗": "荒野乱斗",
"007：传奇": "007：传奇",
"天下": "天下",
"极限竞速：地平线": "极限竞速：地平线",
"龙之谷2手游": "龙之谷2手游",
"蛋仔派对": "蛋仔派对",
"虎牙球球": "虎牙球球",
"Badlanders": "Badlanders",
"激战2": "激战2",
"征途2手游": "征途2手游",
"剑灵：革命": "剑灵：革命",
"绝世仙王": "绝世仙王",
"超激斗梦境": "超激斗梦境",
"航海王：燃烧意志": "航海王：燃烧意志",
"红警OL": "红警OL",
"使命召唤系列": "使命召唤系列",
"QQ幻想": "QQ幻想",
"岛": "岛",
"消逝的光芒2": "消逝的光芒2",
"海岛奇兵": "海岛奇兵",
"战意": "战意",
"三国志": "三国志",
"荒野大镖客2": "荒野大镖客2",
"黑色沙漠": "黑色沙漠",
"极光世界 弑神传": "极光世界 弑神传",
"音乐游戏": "音乐游戏",
"九灵神域": "九灵神域",
"QQ幻想世界": "QQ幻想世界",
"Lost Light（萤火突击国际服）": "Lost Light（萤火突击国际服）",
"新飞飞(FlyFF)": "新飞飞(FlyFF)",
"深空之眼": "深空之眼",
"新斗罗大陆": "新斗罗大陆",
"坦克大战": "坦克大战",
"三国战纪": "三国战纪",
"猎人：荒野的召唤": "猎人：荒野的召唤",
"真·三国无双OL": "真·三国无双OL",
"VALORANT": "VALORANT",
"FF14": "FF14",
"不良人2": "不良人2",
"坎公骑冠剑": "坎公骑冠剑",
"瑞奇与叮当": "瑞奇与叮当",
"最终幻想：起源": "最终幻想：起源",
"玄天之剑": "玄天之剑",
"逃脱者2": "逃脱者2",
"远征军：征服者": "远征军：征服者",
"黑暗领域2": "黑暗领域2",
"精灵与萤火意志": "精灵与萤火意志",
"三国": "三国",
"神界2": "神界2",
"诺亚之心": "诺亚之心",
"梦想世界3手游": "梦想世界3手游",
"一起玩农场": "一起玩农场",
"EVE Online": "EVE Online",
"龙族血统": "龙族血统",
"切尔诺贝利突击队": "切尔诺贝利突击队",
"蜀门": "蜀门",
"鹿鼎记": "鹿鼎记",
"五子棋": "五子棋",
"格斗游戏": "格斗游戏",
"环绕走廊": "环绕走廊",
"天穗之咲稻姬": "天穗之咲稻姬",
"重写三国志": "重写三国志",
"Factorio": "Factorio",
"互动点播": "互动点播",
"Dread Hunger": "Dread Hunger",
"星秀": "星秀",
"户外": "户外",
"二次元": "二次元",
"一起看": "一起看",
"美食": "美食",
"颜值": "颜值",
"交友": "交友",
"体育": "体育",
"组队": "组队",
"王者荣耀": "王者荣耀",
"和平精英": "和平精英",
"LOL电竞经理": "LOL电竞经理",
"LOL手游": "LOL手游",
"新游广场": "新游广场",
"金铲铲之战": "金铲铲之战",
"暗区突围": "暗区突围",
"火影忍者手游": "火影忍者手游",
"CF手游": "CF手游",
"棋牌休闲": "棋牌休闲",
"原神": "原神",
"综合手游": "综合手游",
"暗黑破坏神：不朽": "暗黑破坏神：不朽",
"环形战争": "环形战争",
"二次元手游": "二次元手游",
"下载客户端": "下载客户端",
"我要直播": "我要直播"


			
		}
		classes = []
		for k in cateManual:
			classes.append({
				'type_name': k,
				'type_id': cateManual[k]
			})

		result['class'] = classes
		if (filter):
			result['filters'] = self.config['filter']
		return result
	def homeVideoContent(self):
		result = {}
		return result
	def categoryContent(self,tid,pg,filter,extend):
		result = {}
		url = 'http://live.yj1211.work/api/live/getRecommendByPlatformArea?platform=huya&size=20&area={0}&page={1}'.format(tid, pg)
		rsp = self.fetch(url)
		content = rsp.text
		jo = json.loads(content)
		videos = []
		vodList = jo['data']
		for vod in vodList:
			aid = (vod['roomId']).strip()
			title = vod['roomName'].strip()
			img = vod['roomPic'].strip()
			remark = (vod['categoryName']).strip()
			videos.append({
				"vod_id": aid,
				"vod_name": title,
				"vod_pic": img,
				"vod_remarks": remark
			})
		result['list'] = videos
		result['page'] = pg
		result['pagecount'] = 9999
		result['limit'] = 90
		result['total'] = 999999
		return result
	def detailContent(self,array):
		aid = array[0]
		url = "http://live.yj1211.work/api/live/getRoomInfo?platform=huya&roomId={0}".format(aid)
		rsp = self.fetch(url)
		jRoot = json.loads(rsp.text)
		jo = jRoot['data']
		title = jo['roomName']
		pic = jo['roomPic']
		desc = str(jo['online'])
		dire = jo['ownerName']
		typeName = jo['categoryName']
		remark = jo['categoryName']
		vod = {
			"vod_id": aid,
			"vod_name": title,
			"vod_pic": pic,
			"type_name": typeName,
			"vod_year": "",
			"vod_area": "",
			"vod_remarks": remark,
			"vod_actor": '在线人数:' + desc,
			"vod_director": dire,
			"vod_content": ""
		}
		playUrl = '原画' + '${0}#'.format(aid)
		vod['vod_play_from'] = '虎牙直播'
		vod['vod_play_url'] = playUrl

		result = {
			'list': [
				vod
			]
		}
		return result
	def searchContent(self,key,quick):
		result = {}
		return result
	def playerContent(self,flag,id,vipFlags):
		result = {}

		url = 'https://mp.huya.com/cache.php?m=Live&do=profileRoom&roomid={0}'.format(id)
		rsp = self.fetch(url)
		jRoot = json.loads(rsp.text)
		jo = jRoot['data']
		ja = jo['stream']['baseSteamInfoList'][0]['sStreamName']
		url = 'http://txtest-xp2p.p2p.huya.com/src/' + ja + '.xs?ratio=4000'

		result["parse"] = 0
		result["playUrl"] = ''
		result["url"] = url
		result["header"] = {
			"User-Agent": "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/100.0.4896.127 Safari/537.36"
		}
		result["contentType"] = 'video/x-flv'
		return result

	config = {
		"player": {},
		"filter": {}
	}
	header = {}

	config = {
		"player": {},
		"filter": {}
	}
	header = {}
	def localProxy(self,param):
		action = {
			'url':'',
			'header':'',
			'param':'',
			'type':'string',
			'after':''
		}
		return [200, "video/MP2T", action, ""]
